CSI API ETABS v1

# cCaseResponseSpectrumGetDirComb Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetDirComb(
    	string Name,
    	ref int MyType,
    	ref double SF
    )

    Function GetDirComb (
    	Name As String,
    	ByRef MyType As Integer,
    	ByRef SF As Double
    ) As Integer

    Dim instance As cCaseResponseSpectrum
    Dim Name As String
    Dim MyType As Integer
    Dim SF As Double
    Dim returnValue As Integer

    returnValue = instance.GetDirComb(Name,
    	MyType, SF)

    int GetDirComb(
    	String^ Name,
    	int% MyType,
    	double% SF
    )

    abstract GetDirComb :
            Name : string *
            MyType : int byref *
            SF : float byref -> int

#### Parameters

Name

    Type: SystemString

MyType

    Type: SystemInt32

SF

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cCaseResponseSpectrum Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com